{
  "about": "About",
  "skills": "Skills",
  "projects": "Projects",
  "webDev": "Web developer",
  "title": "Hi there!",
  "message": "Hi, I'm Tlacaelel and this is my portfolio.",
  "titleAbout": "Hi, my name is Tlacaelel Leon Villaseñor, I’m a web developer",
  "paragraphAbout": "Focused on web development, I know both front-end and back-end, I specialize in JavaScript with several frameworks. I constantly search for learning and I love making things from scratch, together we can build something powerful and exciting.",
  "contactAbout": "Contact me",
  "subjectAbout":"Contact from portfolio",
  "skills-space": {
    "title": "Skills",
    "frontTitle": "Front-end",
    "frontText": "With knowledge in all the front-end technologies, to build static sites, powerful SPA, and translate any design into code. With fluent usage of CSS and HTML",
    "backTitle": "Back-ennd",
    "backText": "I create useful back-end applications, with the usage and integration of the most popular technologies like PHP, Node.js, and connection with databases.",
    "jsTitle": "JavaScript",
    "jsText": "I'm a full-stack developer with JavaScript from the browser to the server with Node.js, I know several frameworks and do a lot of amazing things with JavaScript.",
    "vueTitle": "Vue.js",
    "vueText": "I use Vue.js to build powerful SPA which consumes from an API to give full functionality, and I use Nuxt.js to create beautiful and useful server-side applications.",
    "expressTitle": "Expres.js",
    "expressText": "I know how to build server-side projects with Express.js and to build functional APIs, I implement OAuth to authenticate users with social media.",
    "reactTitle": "React.js",
    "reactText": "I have prior experience with React.js I've built a full-stack application with it, that uses Express.js and consumes from an API made also by me."
  },
  "projectTitle": "Projects",
  "projectVisit": "Visit",
  "projectCode" : "Code",
  "projectsList": [
    {
      "title": "Nutrition cooking",
      "images":["/images/nutrition.png"],
      "desc": "This is an app designed to manage recipes and their caloric and nutrition content, it allows to add ingredients and assemble recipes, using that information to generate the nutrition information of each recipe.\nMade it full-stack, from the database made in mongo and deployed in Atlas to the API with Express.js implementing JWT to authenticate, to the frontend with React.js and Next.js.",
      "live":"https://nutrition-cooking-app-94q4at7zf-radeon777.vercel.app/",
      "source": "https://github.com/tlacalv/nutrition-cooking-app"
    },
    {
      "title": "PDF Covering",
      "desc": "I'ts a small application that loads a PDF and renders it in the DOM, making it possible to draw black rectangles in it, this functionality was made to cover personal information in government documents, and to fulfill the federal law of transparency without exposing personal information. It was integrated with a bigger project that manages this flow.",
      "images":["/images/pdf1.png","/images/pdf2.png"],
      "live":"https://tlacalv.github.io/pdf-covering/",
      "source": "https://github.com/tlacalv/pdf-covering"
    },
    {
      "title": "Currency converter",
      "images":["/images/currency.png"],
      "desc": "A small app created purely with Vue it consumes a currency API and gets the value of the most important currencies. It was designed in an intuitive manner of use, unlike other small apps that make the same.",
      "live":"https://tlacalv.github.io/currency-converter/",
      "source": "https://github.com/tlacalv/currency-converter"
    }
  ]
}
